int/resources/objectRepo/xmlTemplates/opera/Channel/req_PublishChannelRatePlans.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:PublishChannelRatePlansRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:PublishRatePlan>
            <v91:Channel/>
            <v91:HotelCode/>
            <v91:BeginDate/>
            <v91:EndDate/>
            <v91:ChannelCodes>
               <v91:ChannelRatePlanCodes>
                  <v91:Code/>
               </v91:ChannelRatePlanCodes>
               <v91:ChannelRoomTypes>
                  <v91:Code/>
               </v91:ChannelRoomTypes>
            </v91:ChannelCodes>
            <v91:HotelCodes>
               <v91:RatePlanCodes>
                  <v91:Code/>
               </v91:RatePlanCodes>
               <v91:RoomTypes>
                  <v91:Code/>
               </v91:RoomTypes>
            </v91:HotelCodes>
         </v9:PublishRatePlan>
      </v9:PublishChannelRatePlansRQ>
   </soapenv:Body>
</soapenv:Envelope>